app/controllers/tribes_controller.rb

  def index
    @tribes = Tribe.all
---
SELECT "tribes".* FROM "tribes"

  def create
    @tribe = Tribe.new(tribe_params)

    respond_to do |format|
      if @tribe.save
---
INSERT INTO "tribes" ("tribe", "tribesmen", "chief", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["tribe", "fishes"], ["tribesmen", "小红、小明"], ["chief", "小王"], ["created_at", "2024-01-02 01:55:48.335951"], ["updated_at", "2024-01-02 01:55:48.335951"]]

  def update
    respond_to do |format|
      if @tribe.update(tribe_params)
---
UPDATE "tribes" SET "tribe" = ?, "updated_at" = ? WHERE "tribes"."id" = ?  [["tribe", "fisheses"], ["updated_at", "2024-01-04 02:11:07.568462"], ["id", 5]]

  def destroy
    @tribe = Tribe.find(params[:id])
    @tribe.destroy
---
SELECT "tribes".* FROM "tribes" WHERE "tribes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "tribes" WHERE "tribes"."id" = ?  [["id", 1]]

    def set_tribe
      @tribe = Tribe.find(params[:id])
---
SELECT "tribes".* FROM "tribes" WHERE "tribes"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]